Revit 2027 API
Room.ClosedShell Property
Return the closedShell of the Room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryElement ClosedShell { get; }
Public ReadOnly Property ClosedShell As GeometryElement
	Get
public:
property GeometryElement^ ClosedShell {
	GeometryElement^ get ();
}
member ClosedShell : GeometryElement with get
Property Value
GeometryElement
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace